---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LevelFailures.StoryAboveMoved
source: html/87eecc9e-09a0-4f7c-0b7d-d1930b363b53.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LevelFailures.StoryAboveMoved Property

The level set as the Story Above for these levels has moved below these levels. This change will cause these levels to revert to the default Story Above.

## Syntax (C#)
```csharp
public static FailureDefinitionId StoryAboveMoved { get; }
```